[{"index":1,"name":"The Hunger Games","author":"Suzanne Collins","rating":4.33,"description":"In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.,Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love.","genres":"Young Adult,Fiction,Fantasy,Dystopia,Science Fiction,Teen,Audiobook","price":"213,917"},{"index":2,"name":"The Book Thief","author":"Markus Zusak","rating":4.39,"description":"It is 1939. Nazi Germany. The country is holding its breath. Death has never been busier, and will be busier still.,By her brother's graveside, Liesel's life is changed when she picks up a single object, partially hidden in the snow. It is The Gravedigger's Handbook, left behind there by accident, and it is her first act of book thievery. So begins a love affair with books and words, as Liesel, with the help of her accordian-playing foster father, learns to read. Soon she is stealing books from Nazi book-burnings, the mayor's wife's library, wherever there are books to be found.,But these are dangerous times. When Liesel's foster family hides a Jew in their basement, Liesel's world is both opened up, and closed down.,In superbly crafted writing that burns with intensity, award-winning author Markus Zusak has given us one of the most enduring stories of our time.,(Note: this title was not published as YA fiction)","genres":"Historical Fiction,Fiction,Young Adult,Historical,Classics,War,World War II","price":"142,389"},{"index":3,"name":"J.R.R. Tolkien 4-Book Boxed Set: The Hobbit and The Lord of the Rings","author":"J.R.R. Tolkien","rating":4.61,"description":"This four-volume, boxed set contains J.R.R. Tolkien's epic masterworks The Hobbit and the three volumes of The Lord of the Rings (The Fellowship of the Ring, The Two Towers, and The Return of the King).,In The Hobbit, Bilbo Baggins is whisked away from his comfortable, unambitious life in Hobbiton by the wizard Gandalf and a company of dwarves. He finds himself caught up in a plot to raid the treasure hoard of Smaug the Magnificent, a large and very dangerous dragon.,The Lord of the Rings tells of the great quest undertaken by Frodo Baggins and the Fellowship of the Ring: Gandalf the wizard; the hobbits Merry, Pippin, and Sam; Gimli the dwarf; Legolas the elf; Boromir of Gondor; and a tall, mysterious stranger called Strider. J.R.R. Tolkien's three volume masterpiece is at once a classic myth and a modern fairy tale—a story of high and heroic adventure set in the unforgettable landscape of Middle-earth","genres":"Fantasy,Fiction,Classics,Adventure,Science Fiction Fantasy,Epic Fantasy,High Fantasy","price":"2,230"},{"index":4,"name":"The Picture of Dorian Gray","author":"Oscar Wilde","rating":4.12,"description":"Oscar Wilde’s only novel is the dreamlike story of a young man who sells his soul for eternal youth and beauty.,In this celebrated work Wilde forged a devastating portrait of the effects of evil and debauchery on a young aesthete in late-19th-century England. Combining elements of the Gothic horror novel and decadent French fiction, the book centers on a striking premise: As Dorian Gray sinks into a life of crime and gross sensuality, his body retains perfect youth and vigor while his recently painted portrait grows day by day into a hideous record of evil, which he must keep hidden from the world. For over a century, this mesmerizing tale of horror and suspense has enjoyed wide popularity. It ranks as one of Wilde's most important creations and among the classic achievements of its kind.","genres":"Classics,Fiction,Horror,Fantasy,Gothic,Literature,Novels","price":"66,583"},{"index":5,"name":"The Chronicles of Narnia","author":"C.S. Lewis","rating":4.27,"description":"Journeys to the end of the world, fantastic creatures, and epic battles between good and evil—what more could any reader ask for in one book? The book that has it all is ,, written in 1949 by Clive Staples Lewis. But Lewis did not stop there. Six more books followed, and together they became known as ,For the past fifty years, , have transcended the fantasy genre to become part of the canon of classic literature. Each of the seven books is a masterpiece, drawing the reader into a land where magic meets reality, and the result is a fictional world whose scope has fascinated generations.,This edition presents all seven books—unabridged—in one impressive volume. The books are presented here in chronlogical order, each chapter graced with an illustration by the original artist, Pauline Baynes. Deceptively simple and direct, , continue to captivate fans with adventures, characters, and truths that speak to readers of all ages, even fifty years after they were first published.","genres":"Fantasy,Classics,Fiction,Young Adult,Childrens,Christian,Adventure","price":"12,403"},{"index":6,"name":"Animal Farm","author":"George Orwell","rating":3.98,"description":"A farm is taken over by its overworked, mistreated animals. With flaming idealism and stirring slogans, they set out to create a paradise of progress, justice, and equality. Thus the stage is set for one of the most telling satiric fables ever penned –a razor-edged fairy tale for grown-ups that records the evolution from revolution against tyranny to a totalitarianism just as terrible. ,When , was first published, Stalinist Russia was seen as its target. Today it is devastatingly clear that wherever and whenever freedom is attacked, under whatever banner, the cutting clarity and savage comedy of George Orwell’s masterpiece have a meaning and message still ferociously fresh.","genres":"Classics,Fiction,Dystopia,Fantasy,School,Literature,Science Fiction","price":"92,760"},{"index":7,"name":"Twilight","author":"Stephenie Meyer","rating":3.65,"description":"About three things I was absolutely positive.,First, Edward was a vampire.,Second, there was a part of him - and I didn't know how dominant that part might be - that thirsted for my blood.,And third, I was unconditionally and irrevocably in love with him.","genres":"Young Adult,Romance,Fiction,Vampires,Paranormal,Paranormal Romance,Supernatural","price":"128,138"},{"index":8,"name":"Gone with the Wind","author":"Margaret Mitchell","rating":4.31,"description":"Scarlett O'Hara, the beautiful, spoiled daughter of a well-to-do Georgia plantation owner, must use every means at her disposal to claw her way out of the poverty she finds herself in after Sherman's March to the Sea.","genres":"Classics,Historical Fiction,Fiction,Romance,Historical,Literature,War","price":"23,943"},{"index":9,"name":"The Fault in Our Stars","author":"John Green","rating":4.14,"description":"","genres":"","price":"177,261"},{"index":10,"name":"Pride and Prejudice","author":"Jane Austen","rating":4.28,"description":"Since its immediate success in 1813, , has remained one of the most popular novels in the English language. Jane Austen called this brilliant work \"her own darling child\" and its vivacious heroine, Elizabeth Bennet, \"as delightful a creature as ever appeared in print.\" The romantic clash between the opinionated Elizabeth and her proud beau, Mr. Darcy, is a splendid performance of civilized sparring. And Jane Austen's radiant wit sparkles as her characters dance a delicate quadrille of flirtation and intrigue, making this book the most superb comedy of manners of Regency England.","genres":"Classics,Fiction,Romance,Historical Fiction,Historical,Literature,Audiobook","price":"110,639"},{"index":11,"name":"To Kill a Mockingbird","author":"Harper Lee","rating":4.26,"description":"The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. \"To Kill A Mockingbird\" became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.,Compassionate, dramatic, and deeply moving, \"To Kill A Mockingbird\" takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.","genres":"Classics,Fiction,Historical Fiction,School,Literature,Young Adult,Historical","price":"115,265"},{"index":12,"name":"Harry Potter and the Order of the Phoenix","author":"J.K. Rowling","rating":4.5,"description":"Harry Potter is about to start his fifth year at Hogwarts School of Witchcraft and Wizardry. Unlike most schoolboys, Harry never enjoys his summer holidays, but this summer is even worse than usual. The Dursleys, of course, are making his life a misery, but even his best friends, Ron and Hermione, seem to be neglecting him.,Harry has had enough. He is beginning to think he must do something, anything, to change his situation, when the summer holidays come to an end in a very dramatic fashion. What Harry is about to discover in his new year at Hogwarts will turn his world upside down...","genres":"Fantasy,Young Adult,Fiction,Magic,Childrens,Audiobook,Adventure","price":"61,689"},{"index":13,"name":"The Lightning Thief","author":"Rick Riordan","rating":4.3,"description":"Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth about where he came from, and that he go to the one place he'll be safe. She sends Percy to Camp Half Blood, a summer camp for demigods (on Long Island), where he learns that the father he never knew is Poseidon, God of the Sea. Soon a mystery unfolds and together with his friends—one a satyr and the other the demigod daughter of Athena - Percy sets out on a quest across the United States to reach the gates of the Underworld (located in a recording studio in Hollywood) and prevent a catastrophic war between the gods.","genres":"Fantasy,Young Adult,Mythology,Fiction,Middle Grade,Adventure,Greek Mythology","price":"97,403"},{"index":14,"name":"The Little Prince","author":"Antoine de Saint-Exupéry","rating":4.32,"description":"A pilot stranded in the desert awakes one morning to see, standing before him, the most extraordinary little fellow. \"Please,\" asks the stranger, \"draw me a sheep.\" And the pilot realizes that when life's events are too difficult to understand, there is no choice but to succumb to their mysteries. He pulls out pencil and paper... And thus begins this wise and enchanting fable that, in teaching the secret of what is really important in life, has changed forever the world for its readers.,Few stories are as widely read and as universally cherished by children and adults alike as ,, presented here in a stunning new translation with carefully restored artwork. The definitive edition of a worldwide classic, it will capture the hearts of readers of all ages.","genres":"Classics,Fiction,Fantasy,Childrens,France,Philosophy,Young Adult","price":"65,652"},{"index":15,"name":"The Great Gatsby","author":"F. Scott Fitzgerald","rating":3.93,"description":", F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when , noted \"gin was the national drink and sex the national obsession,\" it is an exquisitely crafted tale of America in the 1920s., is one of the great classics of twentieth-century literature.,(from the back cover)","genres":"Classics,Fiction,School,Historical Fiction,Romance,Literature,Novels","price":"101,701"},{"index":16,"name":"Jane Eyre","author":"Charlotte Brontë","rating":4.15,"description":".,Charlotte Brontë tells the story of orphaned Jane Eyre, who grows up in the home of her heartless aunt, enduring loneliness and cruelty. This troubled childhood strengthens Jane's natural independence and spirit - which prove necessary when she finds employment as a governess to the young ward of Byronic, brooding Mr Rochester. As her feelings for Rochester develop, Jane gradually uncovers Thornfield Hall's terrible secret, forcing her to make a choice. Should she stay with Rochester and live with the consequences, or follow her convictions - even if it means leaving the man she loves? A novel of intense power and intrigue, , dazzled readers with its passionate depiction of a woman's search for equality and freedom.","genres":"Classics,Fiction,Historical Fiction,Gothic,Literature,Historical,School","price":"63,012"},{"index":17,"name":"The Old Man and the Sea","author":"Ernest Hemingway","rating":3.8,"description":"This short novel, already a modern classic, is the superbly told, tragic story of a Cuban fisherman in the Gulf Stream and the giant Marlin he kills and loses—specifically referred to in the citation accompanying the author's Nobel Prize for literature in 1954.","genres":"Classics,Fiction,Literature,Novels,American,School,Adventure","price":"38,464"},{"index":18,"name":"Harry Potter and the Goblet of Fire","author":"J.K. Rowling","rating":4.56,"description":"It is the summer holidays and soon Harry Potter will be starting his fourth year at Hogwarts School of Witchcraft and Wizardry. Harry is counting the days: there are new spells to be learnt, more Quidditch to be played, and Hogwarts castle to continue exploring. But Harry needs to be careful - there are unexpected dangers lurking...","genres":"Fantasy,Young Adult,Fiction,Magic,Childrens,Middle Grade,Audiobook","price":"67,243"},{"index":19,"name":"The Poisonwood Bible","author":"Barbara Kingsolver","rating":4.09,"description":" is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is a suspenseful epic of one family's tragic undoing and remarkable reconstruction over the course of three decades in postcolonial Africa.","genres":"Fiction,Historical Fiction,Africa,Classics,Literary Fiction,Historical,Literature","price":"27,003"},{"index":20,"name":"Don Quixote","author":"Miguel de Cervantes Saavedra","rating":3.9,"description":"Don Quixote has become so entranced by reading chivalric romances that he determines to become a knight-errant himself. In the company of his faithful squire, Sancho Panza, his exploits blossom in all sorts of wonderful ways. While Quixote's fancy often leads him astray—he tilts at windmills, imagining them to be giants—Sancho acquires cunning and a certain sagacity. Sane madman and wise fool, they roam the world together, and together they have haunted readers' imaginations for nearly four hundred years.,With its experimental form and literary playfulness, , has been generally recognized as the first modern novel. The book has been enormously influential on a host of writers, from Fielding and Sterne to Flaubert, Dickens, Melville, and Faulkner, who reread it once a year, \"just as some people read the Bible.\"","genres":"Classics,Fiction,Literature,Spanish Literature,Adventure,Historical Fiction,Novels","price":"11,864"},{"index":21,"name":"Interview with the Vampire","author":"Anne Rice","rating":4.02,"description":"This is the story of Louis, as told in his own words, of his journey through mortal and immortal life. Louis recounts how he became a vampire at the hands of the radiant and sinister Lestat and how he became indoctrinated, unwillingly, into the vampire way of life. His story ebbs and flows through the streets of New Orleans, defining crucial moments such as his discovery of the exquisite lost young child Claudia, wanting not to hurt but to comfort her with the last breaths of humanity he has inside. Yet, he makes Claudia a vampire, trapping her womanly passion, will, and intelligence inside the body of a small child. Louis and Claudia form a seemingly unbreakable alliance and even \"settle down\" for a while in the opulent French Quarter. Louis remembers Claudia's struggle to understand herself and the hatred they both have for Lestat that sends them halfway across the world to seek others of their kind. Louis and Claudia are desperate to find somewhere they belong, to find others who understand, and someone who knows what and why they are.,Louis and Claudia travel Europe, eventually coming to Paris and the ragingly successful Theatre des Vampires--a theatre of vampires pretending to be mortals pretending to be vampires. Here they meet the magnetic and ethereal Armand, who brings them into a whole society of vampires. But Louis and Claudia find that finding others like themselves provides no easy answers and in fact presents dangers they scarcely imagined.,Originally begun as a short story, the book took off as Anne wrote it, spinning the tragic and triumphant life experiences of a soul. As well as the struggles of its characters, Interview captures the political and social changes of two continents. The novel also introduces Lestat, Anne's most enduring character, a heady mixture of attraction and revulsion. The book, full of lush description, centers on the themes of immortality, change, loss, sexuality, and power.,source: annerice.com","genres":"Horror,Fantasy,Fiction,Vampires,Paranormal,Classics,Gothic","price":"15,712"},{"index":22,"name":"The Complete Stories and Poems","author":"Edgar Allan Poe","rating":4.39,"description":"This single volume brings together all of Poe's stories and poems, and illuminates the diverse and multifaceted genius of one of the greatest and most influential figures in American literary history.","genres":"Classics,Poetry,Horror,Fiction,Short Stories,Gothic,Mystery","price":"2,136"},{"index":23,"name":"The Shining","author":"Stephen King","rating":4.27,"description":"Jack Torrance's new job at the Overlook Hotel is the perfect chance for a fresh start. As the off-season caretaker at the atmospheric old hotel, he'll have plenty of time to spend reconnecting with his family and working on his writing. But as the harsh winter weather sets in, the idyllic location feels ever more remote...and more sinister. And the only one to notice the strange and terrible forces gathering around the Overlook is Danny Torrance, a uniquely gifted five-year-old.","genres":"Horror,Fiction,Thriller,Classics,Fantasy,Paranormal,Mystery","price":"37,644"},{"index":24,"name":"Angela's Ashes","author":"Frank McCourt","rating":4.14,"description":"Imbued on every page with Frank McCourt's astounding humor and compassion. This is a glorious book that bears all the marks of a classic.,\"When I look back on my childhood I wonder how I managed to survive at all. It was, of course, a miserable childhood: the happy childhood is hardly worth your while. Worse than the ordinary miserable childhood is the miserable Irish childhood, and worse yet is the miserable Irish Catholic childhood.\" ,So begins the Pulitzer Prize winning memoir of Frank McCourt, born in Depression-era Brooklyn to recent Irish immigrants and raised in the slums of Limerick, Ireland. Frank's mother, Angela, has no money to feed the children since Frank's father, Malachy, rarely works, and when he does he drinks his wages. Yet Malachy—exasperating, irresponsible and beguiling—does nurture in Frank an appetite for the one thing he can provide: a story. Frank lives for his father's tales of Cuchulain, who saved Ireland, and of the Angel on the Seventh Step, who brings his mother babies. ,Perhaps it is story that accounts for Frank's survival. Wearing rags for diapers, begging a pig's head for Christmas dinner and gathering coal from the roadside to light a fire, Frank endures poverty, near-starvation and the casual cruelty of relatives and neighbors—yet lives to tell his tale with eloquence, exuberance and remarkable forgiveness. ,Angela's Ashes, imbued on every page with Frank McCourt's astounding humor and compassion, is a glorious book that bears all the marks of a classic.","genres":"Nonfiction,Memoir,Biography,Classics,Ireland,Autobiography,Biography Memoir","price":"14,085"},{"index":25,"name":"It","author":"Stephen King","rating":4.25,"description":"Welcome to Derry, Maine ...,It’s a small city, a place as hauntingly familiar as your own hometown. Only in Derry the haunting is real ...,They were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But none of them can withstand the force that has drawn them back to Derry to face the nightmare without an end, and the evil without a name.","genres":"Horror,Fiction,Thriller,Fantasy,Classics,Audiobook,Mystery","price":"35,189"},{"index":26,"name":"Siddhartha","author":"Hermann Hesse","rating":4.07,"description":"Herman Hesse's classic novel has delighted, inspired, and influenced generations of readers, writers, and thinkers. In this story of a wealthy Indian Brahmin who casts off a life of privilege to seek spiritual fulfillment. Hesse synthesizes disparate philosophies--Eastern religions, Jungian archetypes, Western individualism--into a unique vision of life as expressed through one man's search for true meaning.","genres":"Classics,Fiction,Philosophy,Spirituality,Religion,Literature,Buddhism","price":"26,316"},{"index":27,"name":"The Golden Compass","author":"Philip Pullman","rating":4.02,"description":"Lyra is rushing to the cold, far North, where witch clans and armored bears rule. North, where the Gobblers take the children they steal--including her friend Roger. North, where her fearsome uncle Asriel is trying to build a bridge to a parallel world.,Can one small girl make a difference in such great and terrible endeavors? This is Lyra: a savage, a schemer, a liar, and as fierce and true a champion as Roger or Asriel could want--but what Lyra doesn't know is that to help one of them will be to betray the other.","genres":"Fantasy,Young Adult,Fiction,Childrens,Adventure,Middle Grade,Science Fiction","price":"27,521"},{"index":28,"name":"To Kill a Mockingbird","author":"Harper Lee","rating":4.26,"description":"'Shoot all the bluejays you want, if you can hit 'em, but remember it's a sin to kill a mockingbird.',A lawyer's advice to his children as he defends the real mockingbird of Harper Lee's classic novel - a black man charged with the rape of a white girl. Through the young eyes of Scout and Jem Finch, Harper Lee explores with exuberant humour the irrationality of adult attitudes to race and class in the Deep South of the 1930s. The conscience of a town steeped in prejudice, violence and hypocrisy is pricked by the stamina of one man's struggle for justice. But the weight of history will only tolerate so much.","genres":"Classics,Fiction,Historical Fiction,School,Literature,Young Adult,Historical","price":"115,265"},{"index":29,"name":"And Then There Were None","author":"Agatha Christie","rating":4.28,"description":"First, there were ten—a curious assortment of strangers summoned as weekend guests to a little private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal—and a secret that will seal their fate. For each has been marked for murder. A famous nursery rhyme is framed and hung in every room of the mansion:,\"Ten little boys went out to dine; One choked his little self and then there were nine. Nine little boys sat up very late; One overslept himself and then there were eight. Eight little boys traveling in Devon; One said he'd stay there then there were seven. Seven little boys chopping up sticks; One chopped himself in half and then there were six. Six little boys playing with a hive; A bumblebee stung one and then there were five. Five little boys going in for law; One got in Chancery and then there were four. Four little boys going out to sea; A red herring swallowed one and then there were three. Three little boys walking in the zoo; A big bear hugged one and then there were two. Two little boys sitting in the sun; One got frizzled up and then there was one. One little boy left all alone; He went out and hanged himself and then there were none.\",When they realize that murders are occurring as described in the rhyme, terror mounts. One by one they fall prey. Before the weekend is out, there will be none. Who has choreographed this dastardly scheme? And who will be left to tell the tale? Only the dead are above suspicion.","genres":"Mystery,Fiction,Thriller,Crime,Mystery Thriller,Classics,Audiobook","price":"62,196"},{"index":30,"name":"Vampire Academy","author":"Richelle Mead","rating":4.11,"description":"Lissa Dragomir is a Moroi princess: a mortal vampire with a rare gift for harnessing the earth's magic. She must be protected at all times from Strigoi; the fiercest vampires—the ones who never die. The powerful blend of human and vampire blood that flows through Rose Hathaway, Lissa's best friend, makes her a dhampir. Rose is dedicated to a dangerous life of protecting Lissa from the Strigoi, who are hell-bent on making Lissa one of them.,After two years of freedom, Rose and Lissa are caught and dragged back to St. Vladimir's Academy, a school for vampire royalty and their guardians-to-be, hidden in the deep forests of Montana. But inside the iron gates, life is even more fraught with danger... and the Strigoi are always close by.,Rose and Lissa must navigate their dangerous world, confront the temptations of forbidden love, and never once let their guard down, lest the evil undead make Lissa one of them forever...","genres":"Young Adult,Fantasy,Vampires,Paranormal,Romance,Urban Fantasy,Fiction","price":"26,257"},{"index":31,"name":"The Road","author":"Cormac McCarthy","rating":3.99,"description":"A searing, postapocalyptic novel destined to become Cormac McCarthy’s masterpiece.,A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind. It is cold enough to crack stones, and when the snow falls it is gray. The sky is dark. Their destination is the coast, although they don’t know what, if anything, awaits them there. They have nothing; just a pistol to defend themselves against the lawless bands that stalk the road, the clothes they are wearing, a cart of scavenged food—and each other., is the profoundly moving story of a journey. It boldly imagines a future in which no hope remains, but in which the father and his son, “each the other’s world entire,” are sustained by love. Awesome in the totality of its vision, it is an unflinching meditation on the worst and the best that we are capable of: ultimate destructiveness, desperate tenacity, and the tenderness that keeps two people alive in the face of total devastation.","genres":"Fiction,Science Fiction,Dystopia,Post Apocalyptic,Horror,Literature,Novels","price":"57,911"},{"index":32,"name":"A Clockwork Orange","author":"Anthony Burgess","rating":4.0,"description":"In Anthony Burgess's influential nightmare vision of the future, criminals take over after dark. Teen gang leader Alex narrates in fantastically inventive slang that echoes the violent intensity of youth rebelling against society. Dazzling and transgressive, , is a frightening fable about good and evil and the meaning of human freedom. This edition includes the controversial last chapter not published in the first edition, and Burgess’s introduction, “A Clockwork Orange Resucked.”","genres":"Classics,Fiction,Science Fiction,Dystopia,Horror,Literature,Novels","price":"20,151"},{"index":33,"name":"A Tree Grows in Brooklyn","author":"Betty  Smith","rating":4.29,"description":"The beloved American classic about a young girl's coming-of-age at the turn of the century, Betty Smith's , is a poignant and moving tale filled with compassion and cruelty, laughter and heartache, crowded with life and people and incident. The story of young, sensitive, and idealistic Francie Nolan and her bittersweet formative years in the slums of Williamsburg has enchanted and inspired millions of readers for more than sixty years. By turns overwhelming, sublime, heartbreaking, and uplifting, the daily experiences of the unforgettable Nolans are raw with honesty and tenderly threaded with family connectedness -- in a work of literary art that brilliantly captures a unique time and place as well as incredibly rich moments of universal experience.","genres":"Classics,Fiction,Historical Fiction,Young Adult,Coming Of Age,Historical,New York","price":"26,505"},{"index":34,"name":"My Sister's Keeper","author":"Jodi Picoult","rating":4.1,"description":" best-selling author Jodi Picoult is widely acclaimed for her keen insights into the hearts and minds of real people. Now she tells the emotionally riveting story of a family torn apart by conflicting needs and a passionate love that triumphs over human weakness. ,Anna is not sick, but she might as well be. By age 13 she has undergone countless surgeries, transfusions, and shots so that her older sister, Kate, can somehow fight the leukemia that has plagued her since childhood. The product of preimplantation genetic diagnosis, Anna was conceived as a bone marrow match for Kate—a life and a role that she has never challenged ... until now. Like most teenagers, Anna is beginning to question who she truly is. But unlike most teenagers, she has always been defined in terms of her sister—and so Anna makes a decision that for most would be unthinkable, a decision that will tear her family apart and have perhaps fatal consequences for the sister she loves. , examines what it means to be a good parent, a good sister, a good person. Is it morally correct to do whatever it takes to save a child's life, even if that means infringing upon the rights of another? Is it worth trying to discover who you really are if that quest makes you like yourself less? Should you follow your own heart or let others lead you? Once again, in ,, Jodi Picoult tackles a controversial real-life subject with grace, wisdom, and sensitivity.","genres":"Fiction,Chick Lit,Young Adult,Drama,Adult,Adult Fiction,Realistic Fiction","price":"37,131"},{"index":35,"name":"The Color Purple","author":"Alice Walker","rating":4.26,"description":"A powerful cultural touchstone of modern American literature, , depicts the lives of African American women in early twentieth-century rural Georgia. Separated as girls, sisters Celie and Nettie sustain their loyalty to and hope in each other across time, distance and silence. Through a series of letters spanning twenty years, first from Celie to God, then the sisters to each other despite the unknown, the novel draws readers into its rich and memorable portrayals of Celie, Nettie, Shug Avery and Sofia and their experience. , broke the silence around domestic and sexual abuse, narrating the lives of women through their pain and struggle, companionship and growth, resilience and bravery. Deeply compassionate and beautifully imagined, Alice Walker's epic carries readers on a spirit-affirming journey towards redemption and love.,“Reading ","genres":"Fiction,Historical Fiction,Feminism,Classics,LGBT,Historical,Queer","price":"24,312"},{"index":36,"name":"The Brothers Karamazov","author":"Fyodor Dostoevsky","rating":4.37,"description":"The Brothers Karamazov is a murder mystery, a courtroom drama, and an exploration of erotic rivalry in a series of triangular love affairs involving the “wicked and sentimental” Fyodor Pavlovich Karamazov and his three sons―the impulsive and sensual Dmitri; the coldly rational Ivan; and the healthy, red-cheeked young novice Alyosha. Through the gripping events of their story, Dostoevsky portrays the whole of Russian life, is social and spiritual striving, in what was both the golden age and a tragic turning point in Russian culture.,This award-winning translation by Richard Pevear and Larissa Volokhonsky remains true to the verbal inventiveness of Dostoevsky’s prose, preserving the multiple voices, the humor, and the surprising modernity of the original. It is an achievement worthy of Dostoevsky’s last and greatest novel.","genres":"Classics,Fiction,Russia,Russian Literature,Literature,Philosophy,Novels","price":"18,232"},{"index":37,"name":"One Flew Over the Cuckoo's Nest","author":"Ken Kesey","rating":4.2,"description":"Alternate cover edition of ISBN ,Tyrannical Nurse Ratched rules her ward in an Oregon State mental hospital with a strict and unbending routine, unopposed by her patients, who remain cowed by mind-numbing medication and the threat of electric shock therapy. But her regime is disrupted by the arrival of McMurphy – the swaggering, fun-loving trickster with a devilish grin who resolves to oppose her rules on behalf of his fellow inmates. His struggle is seen through the eyes of Chief Bromden, a seemingly mute half-Indian patient who understands McMurphy's heroic attempt to do battle with the powers that keep them imprisoned. Ken Kesey's extraordinary first novel is an exuberant, ribald and devastatingly honest portrayal of the boundaries between sanity and madness.","genres":"Fiction,Classics,Psychology,Literature,Novels,Mental Health,School","price":"15,565"},{"index":38,"name":"Anna Karenina","author":"Leo Tolstoy","rating":4.09,"description":"Acclaimed by many as the world's greatest novel, , provides a vast panorama of contemporary life in Russia and of humanity in general. In it Tolstoy uses his intense imaginative insight to create some of the most memorable characters in all of literature. Anna is a sophisticated woman who abandons her empty existence as the wife of Karenin and turns to Count Vronsky to fulfil her passionate nature - with tragic consequences. Levin is a reflection of Tolstoy himself, often expressing the author's own views and convictions.,Throughout, Tolstoy points no moral, merely inviting us not to judge but to watch. As Rosemary Edmonds comments, 'He leaves the shifting patterns of the kaleidoscope to bring home the meaning of the brooding words following the title, 'Vengeance is mine, and I will repay.","genres":"Classics,Fiction,Romance,Russia,Historical Fiction,Russian Literature,Literature","price":"34,440"},{"index":39,"name":"The Girl with the Dragon Tattoo","author":"Stieg Larsson","rating":4.17,"description":"Harriet Vanger, a scion of one of Sweden’s wealthiest families disappeared over forty years ago. All these years later, her aged uncle continues to seek the truth. He hires Mikael Blomkvist, a crusading journalist recently trapped by a libel conviction, to investigate. He is aided by the pierced and tattooed punk prodigy Lisbeth Salander. Together they tap into a vein of unfathomable iniquity and astonishing corruption.,An international publishing sensation, Stieg Larsson’s The Girl with the Dragon Tattoo combines murder mystery, family saga, love story, and financial intrigue into one satisfyingly complex and entertainingly atmospheric novel.","genres":"Fiction,Mystery,Thriller,Crime,Mystery Thriller,Suspense,Contemporary","price":"76,810"},{"index":40,"name":"Outlander","author":"Diana Gabaldon","rating":4.26,"description":"The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743., ,Hurled back in time by forces she cannot understand, Claire is catapulted into the intrigues of lairds and spies that may threaten her life, and shatter her heart. For here James Fraser, a gallant young Scots warrior, shows her a love so absolute that Claire becomes a woman torn between fidelity and desire—and between two vastly different men in two irreconcilable lives.","genres":"Historical Fiction,Romance,Fantasy,Fiction,Time Travel,Historical,Historical Romance","price":"53,390"},{"index":41,"name":"Great Expectations","author":"Charles Dickens","rating":3.79,"description":"Great Expectations charts the progress of Pip from childhood through often painful experiences to adulthood, as he moves from the Kent marshes to busy, commercial London, encountering a variety of extraordinary characters ranging from Magwitch, the escaped convict, to Miss Havisham, locked up with her unhappy past and living with her ward, the arrogant, beautiful Estella.,Pip must discover his true self, and his own set of values and priorities. Whether such values allow one to prosper in the complex world of early Victorian England is the major question posed by Great Expectations, one of Dickens's most fascinating, and disturbing, novels.,This edition includes the original, discarded ending, Dickens's brief working notes, and the serial instalments and chapter divisions in different editions. It also uses the definitive Clarendon text.","genres":"Classics,Fiction,Literature,Historical Fiction,School,Novels,19th Century","price":"21,683"},{"index":42,"name":"Rebecca","author":"Daphne du Maurier","rating":4.24,"description":"\"Last night I dreamt I went to Manderley again...\",Ancient, beautiful Manderley, between the rose garden and the sea, is the county's showpiece. Rebecca made it so - even a year after her death, Rebecca's influence still rules there. How can Maxim de Winter's shy new bride ever fill her place or escape her vital shadow?,A shadow that grows longer and darker as the brief summer fades, until, in a moment of climatic revelations, it threatens to eclipse Manderley and its inhabitants completely...","genres":"Fiction,Mystery,Gothic,Romance,Classics,Historical Fiction,Thriller","price":"39,002"},{"index":43,"name":"The Adventures of Sherlock Holmes","author":"Arthur Conan Doyle","rating":4.3,"description":" is the series of short stories that made the fortunes of the Strand magazine, in which they were first published, and won immense popularity for Sherlock Holmes and Dr Watson. The detective is at the height of his powers and the volume is full of famous cases, including 'The Red-Headed League', 'The Blue Carbuncle', and 'The Speckled Band'. ,The editor of this volume, Richard Lancelyn Green is editor of , and ,. With John Michael Gibson, he compiled the Soho Series Bibliography of A. Conan Doyle.","genres":"Mystery,Fiction,Short Stories,Classics,Crime,Detective,Mystery Thriller","price":"9,210"},{"index":44,"name":"Watership Down","author":"Richard  Adams","rating":4.08,"description":"Set in England's Downs, a once idyllic rural landscape, this stirring tale of adventure, courage and survival follows a band of very special creatures on their flight from the intrusion of man and the certain destruction of their home. Led by a stouthearted pair of friends, they journey forth from their native Sandleford Warren through the harrowing trials posed by predators and adversaries, to a mysterious promised land and a more perfect society.","genres":"Classics,Fiction,Fantasy,Young Adult,Animals,Childrens,Adventure","price":"17,157"},{"index":45,"name":"The Pillars of the Earth","author":"Ken Follett","rating":4.34,"description":"Everything readers expect from Follett is here: intrigue, fast-paced action, and passionate romance. But what makes , extraordinary is the time the twelfth century; the place feudal England; and the subject the building of a glorious cathedral. Follett has re-created the crude, flamboyant England of the Middle Ages in every detail. The vast forests, the walled towns, the castles, and the monasteries become a familiar landscape. ,Against this richly imagined and intricately interwoven backdrop, filled with the ravages of war and the rhythms of daily life, the master storyteller draws the reader irresistibly into the intertwined lives of his characters into their dreams, their labors, and their loves: Tom, the master builder; Aliena, the ravishingly beautiful noblewoman; Philip, the prior of Kingsbridge; Jack, the artist in stone; and Ellen, the woman of the forest who casts a terrifying curse. From humble stonemason to imperious monarch, each character is brought vividly to life.,The building of the cathedral, with the almost eerie artistry of the unschooled stonemasons, is the center of the drama. Around the site of the construction, Follett weaves a story of betrayal, revenge, and love, which begins with the public hanging of an innocent man and ends with the humiliation of a king.","genres":"Historical Fiction,Fiction,Historical,Fantasy,Classics,Medieval,Audiobook","price":"36,990"},{"index":46,"name":"Catch-22","author":"Joseph Heller","rating":3.99,"description":"Fifty years after its original publication, Catch-22 remains a cornerstone of American literature and one of the funniest—and most celebrated—books of all time. In recent years it has been named to “best novels” lists by Time, Newsweek, the Modern Library, and the London Observer.,Set in Italy during World War II, this is the story of the incomparable, malingering bombardier, Yossarian, a hero who is furious because thousands of people he has never met are trying to kill him. But his real problem is not the enemy—it is his own army, which keeps increasing the number of missions the men must fly to complete their service. Yet if Yossarian makes any attempt to excuse himself from the perilous missions he’s assigned, he’ll be in violation of Catch-22, a hilariously sinister bureaucratic rule: a man is considered insane if he willingly continues to fly dangerous combat missions, but if he makes a formal request to be removed from duty, he is proven sane and therefore ineligible to be relieved.,This fiftieth-anniversary edition commemorates Joseph Heller’s masterpiece with a new introduction by Christopher Buckley; a wealth of critical essays and reviews by Norman Mailer, Alfred Kazin, Anthony Burgess, and others; rare papers and photos from Joseph Heller’s personal archive; and much more. Here, at last, is the definitive edition of a classic of world literature.","genres":"Classics,Fiction,Historical Fiction,War,Humor,Literature,Novels","price":"23,058"},{"index":47,"name":"Matilda","author":"Roald Dahl","rating":4.34,"description":"Matilda is a little girl who is far too good to be true. At age five-and-a-half she's knocking off double-digit multiplication problems and blitz-reading Dickens. Even more remarkably, her classmates love her even though she's a super-nerd and the teacher's pet. But everything is not perfect in Matilda's world...,For starters she has two of the most idiotic, self-centered parents who ever lived. Then there's the large, busty nightmare of a school principal, Miss (\"The\") Trunchbull, a former hammer-throwing champion who flings children at will, and is approximately as sympathetic as a bulldozer. Fortunately for Matilda, she has the inner resources to deal with such annoyances: astonishing intelligence, saintly patience, and an innate predilection for revenge., was a spy, ace fighter-pilot, chocolate historian, and medical inventor. He was also the author of , and many more brilliant stories. He remains the World's No. 1 Storyteller.","genres":"Childrens,Fiction,Classics,Fantasy,Middle Grade,Young Adult,Humor","price":"22,936"},{"index":48,"name":"The Stand","author":"Stephen King","rating":4.35,"description":"First came the days of the plague. Then came the dreams. Dark dreams that warned of the coming of the dark man. The apostate of death, his worn-down boot heels tramping the night roads. The warlord of the charnel house and Prince of Evil. His time is at hand. His empire grows in the west and the Apocalypse looms.,For hundreds of thousands of fans who read The Stand in its original version and wanted more, this new edition is Stephen King's gift. And those who are listening to The Stand for the first time will discover a triumphant and eerily plausible work of the imagination that takes on the issues that will determine our survival.","genres":"Horror,Fiction,Fantasy,Science Fiction,Post Apocalyptic,Thriller,Dystopia","price":"28,863"},{"index":49,"name":"The Bell Jar","author":"Sylvia Plath","rating":4.05,"description":"The Bell Jar chronicles the crack-up of Esther Greenwood: brilliant, beautiful, enormously talented, and successful, but slowly going under—maybe for the last time. Sylvia Plath masterfully draws the reader into Esther's breakdown with such intensity that Esther's insanity becomes completely real and even rational, as probable and accessible an experience as going to the movies. Such deep penetration into the dark and harrowing corners of the psyche is an extraordinary accomplishment and has made The Bell Jar a haunting American classic.","genres":"Fiction,Feminism,Classics,Mental Health,Psychology,Literature,Poetry","price":"52,389"},{"index":50,"name":"Harry Potter and the Prisoner of Azkaban","author":"J.K. Rowling","rating":4.58,"description":"Harry Potter, along with his best friends, Ron and Hermione, is about to start his third year at Hogwarts School of Witchcraft and Wizardry. Harry can't wait to get back to school after the summer holidays. (Who wouldn't if they lived with the horrible Dursleys?) But when Harry gets to Hogwarts, the atmosphere is tense. There's an escaped mass murderer on the loose, and the sinister prison guards of Azkaban have been called in to guard the school...","genres":"Fantasy,Fiction,Young Adult,Magic,Childrens,Middle Grade,Audiobook","price":"81,473"},{"index":51,"name":"Water for Elephants","author":"Sara Gruen","rating":4.11,"description":"When Jacob Jankowski, recently orphaned and suddenly adrift, jumps onto a passing train, he enters a world of freaks, drifters, and misfits, a second-rate circus struggling to survive during the Great Depression, making one-night stands in town after endless town. A veterinary student who almost earned his degree, Jacob is put in charge of caring for the circus menagerie. It is there that he meets Marlena, the beautiful young star of the equestrian act, who is married to August, the charismatic but twisted animal trainer. He also meets Rosie, an elephant who seems untrainable until he discovers a way to reach her. ,Beautifully written, Water for Elephants is illuminated by a wonderful sense of time and place. It tells a story of a love between two people that overcomes incredible odds in a world in which even love is a luxury that few can afford.","genres":"Fiction,Historical Fiction,Romance,Historical,Adult,Adult Fiction,Contemporary","price":"62,117"},{"index":52,"name":"Slaughterhouse-Five","author":"Kurt Vonnegut Jr.","rating":4.09,"description":", an American classic, is one of the world’s great antiwar books. Centering on the infamous World War II firebombing of Dresden, the novel is the result of what Kurt Vonnegut described as a twenty-three-year struggle to write a book about what he had witnessed as an American prisoner of war. It combines historical fiction, science fiction, autobiography, and satire in an account of the life of Billy Pilgrim, a barber’s son turned draftee turned optometrist turned alien abductee. As Vonnegut had, Billy experiences the destruction of Dresden as a POW. Unlike Vonnegut, he experiences time travel, or coming “unstuck in time.”, An instant bestseller, ,made Kurt Vonnegut a cult hero in American literature, a reputation that only strengthened over time, despite his being banned and censored by some libraries and schools for content and language. But it was precisely those elements of Vonnegut’s writing—the political edginess, the genre-bending inventiveness, the frank violence, the transgressive wit—that have inspired generations of readers not just to look differently at the world around them but to find the confidence to say something about it. , Fifty years after its initial publication at the height of the Vietnam War, Vonnegut's portrayal of political disillusionment, PTSD, and postwar anxiety feels as relevant, darkly humorous, and profoundly affecting as ever, an enduring beacon through our own era’s uncertainties.","genres":"Fiction,Science Fiction,Classics,Historical Fiction,War,Literature,Novels","price":"38,668"},{"index":53,"name":"Dune","author":"Frank Herbert","rating":4.26,"description":"Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the “spice” melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for...,When House Atreides is betrayed, the destruction of Paul’s family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad’Dib, he will bring to fruition humankind’s most ancient and unattainable dream.,***,Original, first edition from 1965 can be found ,.","genres":"Science Fiction,Fiction,Fantasy,Science Fiction Fantasy,Classics,Audiobook,Space Opera","price":"58,465"},{"index":54,"name":"Lolita","author":"Vladimir Nabokov","rating":3.88,"description":"Humbert Humbert - scholar, aesthete and romantic - has fallen completely and utterly in love with Dolores Haze, his landlady's gum-snapping, silky skinned twelve-year-old daughter. Reluctantly agreeing to marry Mrs Haze just to be close to Lolita, Humbert suffers greatly in the pursuit of romance; but when Lo herself starts looking for attention elsewhere, he will carry her off on a desperate cross-country misadventure, all in the name of Love. Hilarious, flamboyant, heart-breaking and full of ingenious word play, Lolita is an immaculate, unforgettable masterpiece of obsession, delusion and lust.","genres":"Classics,Fiction,Literature,Russia,Novels,Romance,Russian Literature","price":"38,625"},{"index":55,"name":"A Tale of Two Cities","author":"Charles Dickens","rating":3.87,"description":" is Charles Dickens’s great historical novel, set against the violent upheaval of the French Revolution. The most famous and perhaps the most popular of his works, it compresses an event of immense complexity to the scale of a family history, with a cast of characters that includes a bloodthirsty ogress and an antihero as believably flawed as any in modern fiction. Though the least typical of the author’s novels, , still underscores many of his enduring themes—imprisonment, injustice, social anarchy, resurrection, and the renunciation that fosters renewal.","genres":"Classics,Fiction,Historical Fiction,Literature,Historical,School,Novels","price":"22,915"},{"index":56,"name":"Green Eggs and Ham","author":"Dr. Seuss","rating":4.31,"description":"“Do you like green eggs and ham?” asks Sam-I-am in this Beginner Book by Dr. Seuss. In a house or with a mouse? In a boat or with a goat? On a train or in a tree? Sam keeps asking persistently. With unmistakable characters and signature rhymes, Dr. Seuss’s beloved favorite has cemented its place as a children’s classic. In this most famous of cumulative tales, the list of places to enjoy green eggs and ham, and friends to enjoy them with, gets longer and longer. Follow Sam-I-am as he insists that this unusual treat is indeed a delectable snack to be savored everywhere and in every way. ,Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.","genres":"Childrens,Picture Books,Classics,Fiction,Poetry,Fantasy,Humor","price":"11,335"},{"index":57,"name":"Life of Pi","author":"Yann Martel","rating":3.93,"description":"Life of Pi is a fantasy adventure novel by Yann Martel published in 2001. The protagonist, Piscine Molitor \"Pi\" Patel, a Tamil boy from Pondicherry, explores issues of spirituality and practicality from an early age. He survives 227 days after a shipwreck while stranded on a boat in the Pacific Ocean with a Bengal tiger named Richard Parker.","genres":"Fiction,Fantasy,Classics,Adventure,Magical Realism,Novels,Literature","price":"52,839"},{"index":58,"name":"The Handmaid’s Tale","author":"Margaret Atwood","rating":4.13,"description":"Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the years before, when she lived and made love with her husband, Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now…,Funny, unexpected, horrifying, and altogether convincing, , is at once scathing satire, dire warning, and tour de force.","genres":"Fiction,Classics,Dystopia,Science Fiction,Feminism,Fantasy,Adult","price":"94,353"},{"index":59,"name":"The Adventures of Huckleberry Finn","author":"Mark Twain","rating":3.83,"description":"A nineteenth-century boy from a Mississippi River town recounts his adventures as he travels down the river with a runaway slave, encountering a family involved in a feud, two scoundrels pretending to be royalty, and Tom Sawyer's aunt who mistakes him for Tom.","genres":"Classics,Fiction,Historical Fiction,Literature,Young Adult,Adventure,School","price":"19,259"},{"index":60,"name":"The Giver","author":"Lois Lowry","rating":4.12,"description":"At the age of twelve, Jonas, a young boy from a seemingly utopian, futuristic world, is singled out to receive special training from The Giver, who alone holds the memories of the true joys and pain of life.","genres":"Young Adult,Fiction,Classics,Dystopia,Science Fiction,Fantasy,School","price":"78,085"},{"index":61,"name":"Where the Wild Things Are","author":"Maurice Sendak","rating":4.24,"description":"Max, a wild and naughty boy, is sent to bed without his supper by his exhausted mother. In his room, he imagines sailing far away to a land of Wild Things. Instead of eating him, the Wild Things make Max their king.","genres":"Picture Books,Childrens,Fiction,Classics,Fantasy,Adventure,Young Adult","price":"13,771"},{"index":62,"name":"The Lovely Bones","author":"Alice Sebold","rating":3.85,"description":"\"My name was Salmon, like the fish; first name, Susie. I was fourteen when I was murdered on December 6, 1973.\",So begins the story of Susie Salmon, who is adjusting to her new home in heaven, a place that is not at all what she expected, even as she is watching life on earth continue without her -- her friends trading rumors about her disappearance, her killer trying to cover his tracks, her grief-stricken family unraveling. Out of unspeakable tragedy and loss, The Lovely Bones succeeds, miraculously, in building a tale filled with hope, humor, suspense, even joy.","genres":"Fiction,Mystery,Young Adult,Contemporary,Fantasy,Crime,Thriller","price":"45,939"},{"index":63,"name":"Harry Potter and the Deathly Hallows","author":"J.K. Rowling","rating":4.62,"description":"Harry has been burdened with a dark, dangerous and seemingly impossible task: that of locating and destroying Voldemort's remaining Horcruxes. Never has Harry felt so alone, or faced a future so full of shadows. But Harry must somehow find within himself the strength to complete the task he has been given. He must leave the warmth, safety and companionship of The Burrow and follow without fear or hesitation the inexorable path laid out for him...,In this final, seventh installment of the Harry Potter series, J.K. Rowling unveils in spectacular fashion the answers to the many questions that have been so eagerly awaited.","genres":"Fantasy,Young Adult,Fiction,Magic,Childrens,Adventure,Audiobook","price":"83,731"},{"index":64,"name":"The Kite Runner","author":"Khaled Hosseini","rating":4.34,"description":"1970s Afghanistan: Twelve-year-old Amir is desperate to win the local kite-fighting tournament and his loyal friend Hassan promises to help him. But neither of the boys can foresee what would happen to Hassan that afternoon, an event that is to shatter their lives. After the Russians invade and the family is forced to flee to America, Amir realises that one day he must return to an Afghanistan under Taliban rule to find the one thing that his new world cannot grant him: redemption.","genres":"Fiction,Historical Fiction,Classics,Contemporary,Novels,Historical,Literature","price":"96,020"},{"index":65,"name":"Frankenstein: The 1818 Text","author":"Mary Wollstonecraft Shelley","rating":3.86,"description":" ,Mary Shelley's seminal novel of the scientist whose creation becomes a monster. ,This edition is the original 1818 text, which preserves the hard-hitting and politically charged aspects of Shelley's original writing, as well as her unflinching wit and strong female voice. This edition also includes a new introduction and suggestions for further reading by author and Shelley expert Charlotte Gordon, literary excerpts and reviews selected by Gordon and a chronology and essay by preeminent Shelley scholar Charles E. Robinson.","genres":"Horror,Fiction,Science Fiction,Gothic,Fantasy,School,Literature","price":"60,024"},{"index":66,"name":"Little Women","author":"Louisa May Alcott","rating":4.15,"description":"Generations of readers young and old, male and female, have fallen in love with the March sisters of Louisa May Alcott’s most popular and enduring novel, ,. Here are talented tomboy and author-to-be Jo, tragically frail Beth, beautiful Meg, and romantic, spoiled Amy, united in their devotion to each other and their struggles to survive in New England during the Civil War.","genres":"Classics,Fiction,Historical Fiction,Young Adult,Romance,Historical,Literature","price":"49,499"},{"index":67,"name":"1984","author":"George Orwell","rating":4.19,"description":"Among the seminal texts of the 20th century, , is a rare work that grows more haunting as its futuristic purgatory becomes more real. Published in 1949, the book offers political satirist George Orwell's nightmarish vision of a totalitarian, bureaucratic world and one poor stiff's attempt to find individuality. The brilliance of the novel is Orwell's prescience of modern life—the ubiquity of television, the distortion of the language—and his ability to construct such a thorough version of hell. Required reading for students since it was published, it ranks among the most terrifying novels ever written.","genres":"Classics,Fiction,Science Fiction,Dystopia,Literature,Politics,Novels","price":"111,621"},{"index":68,"name":"The Odyssey","author":"Homer","rating":3.8,"description":"So begins Robert Fagles' magnificent translation of the ,.,If the , is the world's greatest war epic, then the , is literature's grandest evocation of everyman's journey though life. Odysseus' reliance on his wit and wiliness for survival in his encounters with divine and natural forces, during his ten-year voyage home to Ithaca after the Trojan War, is at once a timeless human story and an individual test of moral endurance. ,In the myths and legends that are retold here, Fagles has captured the energy and poetry of Homer's original in a bold, contemporary idiom, and given us an , to read aloud, to savor, and to treasure for its sheer lyrical mastery.,Renowned classicist Bernard Knox's superb Introduction and textual commentary provide new insights and background information for the general reader and scholar alike, intensifying the strength of Fagles' translation.,This is an , to delight both the classicist and the public at large, and to captivate a new generation of Homer's students.,--,Robert Fagles, winner of the PEN\/Ralph Manheim Medal for Translation and a 1996 Academy Award in Literature from the American Academy of Arts and Letters, presents us with Homer's best-loved and most accessible poem in a stunning new modern-verse translation.","genres":"Classics,Fiction,Poetry,Mythology,Fantasy,School,Literature","price":"18,573"},{"index":69,"name":"A Wrinkle in Time","author":"Madeleine L'Engle","rating":3.98,"description":"Out of this wild night, a strange visitor comes to the Murry house and beckons Meg, her brother Charles Wallace, and their friend Calvin O'Keefe on a most dangerous and extraordinary adventure—one that will threaten their lives and our universe.,Winner of the 1963 Newbery Medal, , is the first book in Madeleine L'Engle's classic Time Quintet.","genres":"Fantasy,Fiction,Classics,Young Adult,Science Fiction,Childrens,Middle Grade","price":"39,137"},{"index":70,"name":"The Outsiders","author":"S.E. Hinton","rating":4.12,"description":" is about two weeks in the life of a 14-year-old boy. The novel tells the story of Ponyboy Curtis and his struggles with right and wrong in a society in which he believes that he is an outsider. According to Ponyboy, there are two kinds of people in the world: greasers and socs. A soc (short for \"social\") has money, can get away with just about anything, and has an attitude longer than a limousine. A greaser, on the other hand, always lives on the outside and needs to watch his back. Ponyboy is a greaser, and he's always been proud of it, even willing to rumble against a gang of socs for the sake of his fellow greasers--until one terrible night when his friend Johnny kills a soc. The murder gets under Ponyboy's skin, causing his bifurcated world to crumble and teaching him that pain feels the same whether a soc or a greaser.","genres":"Classics,Young Adult,Fiction,School,Read For School,Coming Of Age,Realistic Fiction","price":"45,862"},{"index":71,"name":"The Secret Garden","author":"Frances Hodgson Burnett","rating":4.15,"description":"In a house full of sadness and secrets, can young, orphaned Mary find happiness?,Mary Lennox, a spoiled, ill-tempered, and unhealthy child, comes to live with her reclusive uncle in Misselthwaite Manor on England’s Yorkshire moors after the death of her parents. There she meets a hearty housekeeper and her spirited brother, a dour gardener, a cheerful robin, and her wilful, hysterical, and sickly cousin, Master Colin, whose wails she hears echoing through the house at night.,With the help of the robin, Mary finds the door to a secret garden, neglected and hidden for years. When she decides to restore the garden in secret, the story becomes a charming journey into the places of the heart, where faith restores health, flowers refresh the spirit, and the magic of the garden, coming to life anew, brings health to Colin and happiness to Mary.","genres":"Classics,Fiction,Childrens,Young Adult,Historical Fiction,Middle Grade,Fantasy","price":"27,696"},{"index":72,"name":"The Princess Bride","author":"William Goldman","rating":4.27,"description":"What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams?,As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, ,. But as a grown-up he discovered that the boring parts were left out of good old Dad's recitation, and only the \"good parts\" reached his ears.,Now Goldman does Dad one better. He's reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere.,What's it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex.,In short, it's about everything.","genres":"Fantasy,Classics,Fiction,Romance,Humor,Young Adult,Adventure","price":"25,506"},{"index":73,"name":"A Game of Thrones","author":"George R.R. Martin","rating":4.44,"description":"Long ago, in a time forgotten, a preternatural event threw the seasons out of balance. In a land where summers can last decades and winters a lifetime, trouble is brewing. The cold is returning, and in the frozen wastes to the north of Winterfell, sinister forces are massing beyond the kingdom’s protective Wall. To the south, the king’s powers are failing—his most trusted adviser dead under mysterious circumstances and his enemies emerging from the shadows of the throne. At the center of the conflict lie the Starks of Winterfell, a family as harsh and unyielding as the frozen land they were born to. Now Lord Eddard Stark is reluctantly summoned to serve as the king’s new Hand, an appointment that threatens to sunder not only his family but the kingdom itself.,Sweeping from a harsh land of cold to a summertime kingdom of epicurean plenty, , tells a tale of lords and ladies, soldiers and sorcerers, assassins and bastards, who come together in a time of grim omens. Here an enigmatic band of warriors bear swords of no human metal; a tribe of fierce wildlings carry men off into madness; a cruel young dragon prince barters his sister to win back his throne; a child is lost in the twilight between life and death; and a determined woman undertakes a treacherous journey to protect all she holds dear. Amid plots and counter-plots, tragedy and betrayal, victory and terror, allies and enemies, the fate of the Starks hangs perilously in the balance, as each side endeavors to win that deadliest of conflicts: the game of thrones.","genres":"Fantasy,Fiction,Epic Fantasy,High Fantasy,Adult,Science Fiction Fantasy,Adventure","price":"62,707"},{"index":74,"name":"The Time Traveler’s Wife","author":"Audrey Niffenegger","rating":3.99,"description":"This is the extraordinary love story of Clare and Henry, who met when Clare was six and Henry was thirty-six, and were married when Clare was twenty-two and Henry was thirty. Impossible but true, because Henry suffers from a rare condition where his genetic clock periodically resets and he finds himself pulled suddenly into his past or future. In the face of this force they can neither prevent nor control, Henry and Clare’s struggle to lead normal lives is both intensely moving and entirely unforgettable.","genres":"Fiction,Romance,Fantasy,Time Travel,Science Fiction,Contemporary,Adult","price":"53,034"},{"index":75,"name":"A Thousand Splendid Suns","author":"Khaled Hosseini","rating":4.43,"description":"Mariam is only fifteen when she is sent to Kabul to marry the troubled and bitter Rasheed, who is thirty years her senior. Nearly two decades later, in a climate of growing unrest, tragedy strikes fifteen-year-old Laila, who must leave her home and join Mariam's unhappy household. Laila and Mariam are to find consolation in each other, their friendship to grow as deep as the bond between sisters, as strong as the ties between mother and daughter. ,With the passing of time comes Taliban rule over Afghanistan, the streets of Kabul loud with the sound of gunfire and bombs, life a desperate struggle against starvation, brutality and fear, the women's endurance tested beyond their worst imaginings. Yet love can move people to act in unexpected ways, lead them to overcome the most daunting obstacles with a startling heroism. In the end it is love that triumphs over death and destruction.,\"A Thousand Splendid Suns\" is a portrait of a wounded country and a story of family and friendship, of an unforgiving time, an unlikely bond, and an indestructible love.","genres":"Fiction,Historical Fiction,Contemporary,Historical,Novels,Classics,War","price":"74,769"},{"index":76,"name":"One Hundred Years of Solitude","author":"Gabriel García Márquez","rating":4.11,"description":"The brilliant, bestselling, landmark novel that tells the story of the Buendia family, and chronicles the irreconcilable conflict between the desire for solitude and the need for love—in rich, imaginative prose that has come to define an entire genre known as \"magical realism.\"","genres":"Fiction,Magical Realism,Literature,Fantasy,Novels,Historical Fiction,Spanish Literature","price":"44,482"},{"index":77,"name":"Brave New World","author":"Aldous Huxley","rating":3.99,"description":"Aldous Huxley's profoundly important classic of world literature, , is a searching vision of an unequal, technologically-advanced future where humans are genetically bred, socially indoctrinated, and pharmaceutically anesthetized to passively uphold an authoritarian ruling order–all at the cost of our freedom, full humanity, and perhaps also our souls. “A genius [who] who spent his life decrying the onward march of the Machine” (,), Huxley was a man of incomparable talents: equally an artist, a spiritual seeker, and one of history’s keenest observers of human nature and civilization. ,, his masterpiece, has enthralled and terrified millions of readers, and retains its urgent relevance to this day as both a warning to be heeded as we head into tomorrow and as thought-provoking, satisfying work of literature. Written in the shadow of the rise of fascism during the 1930s, ,d likewise speaks to a 21st-century world dominated by mass-entertainment, technology, medicine and pharmaceuticals, the arts of persuasion, and the hidden influence of elites. ,\"Aldous Huxley is the greatest 20th century writer in English.\" —Chicago Tribune","genres":"Classics,Fiction,Science Fiction,Dystopia,Literature,Novels,School","price":"46,221"},{"index":78,"name":"The Catcher in the Rye","author":"J.D. Salinger","rating":3.8,"description":"Fleeing the crooks at Pencey Prep, he pinballs around New York City seeking solace in fleeting encounters—shooting the bull with strangers in dive hotels, wandering alone round Central Park, getting beaten up by pimps and cut down by erstwhile girlfriends. The city is beautiful and terrible, in all its neon loneliness and seedy glamour, its mingled sense of possibility and emptiness. Holden passes through it like a ghost, thinking always of his kid sister Phoebe, the only person who really understands him, and his determination to escape the phonies and find a life of true meaning., is an all-time classic in coming-of-age literature- an elegy to teenage alienation, capturing the deeply human need for connection and the bewildering sense of loss as we leave childhood behind., (1919–2010) classic novel of teenage angst and rebellion was first published in 1951. The novel was included on ,'s 2005 list of the 100 best English-language novels written since 1923. It was named by Modern Library and its readers as one of the 100 best English-language novels of the 20th century. It has been frequently challenged in the court for its liberal use of profanity and portrayal of sexuality and in the 1950's and 60's it was the novel that every teenage boy wants to read.","genres":"Classics,Fiction,Young Adult,Literature,School,Coming Of Age,Novels","price":"82,939"},{"index":79,"name":"Fahrenheit 451","author":"Ray Bradbury","rating":3.97,"description":"Guy Montag is a fireman. His job is to destroy the most illegal of commodities, the printed book, along with the houses in which they are hidden. Montag never questions the destruction and ruin his actions produce, returning each day to his bland life and wife, Mildred, who spends all day with her television “family.” But when he meets an eccentric young neighbor, Clarisse, who introduces him to a past where people didn’t live in fear and to a present where one sees the world through the ideas in books instead of the mindless chatter of television, Montag begins to question everything he has ever known.","genres":"Fiction,Science Fiction,Dystopia,Classics,School,Literature,Novels","price":"71,746"},{"index":80,"name":"The Alchemist","author":"Paulo Coelho","rating":3.91,"description":"Combining magic, mysticism, wisdom, and wonder into an inspiring tale of self-discovery, , has become a modern classic, selling millions of copies around the world and transforming the lives of countless readers across generations.,Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, following our dreams.","genres":"Fiction,Fantasy,Philosophy,Novels,Spirituality,Self Help,Classics","price":"117,301"},{"index":81,"name":"Of Mice and Men","author":"John Steinbeck","rating":3.88,"description":"They are an unlikely pair: George is , Lennie, a man of tremendous size, has the mind of a young child. Yet they have formed a , clinging together in the face of loneliness and alienation. Laborers in California's dusty vegetable fields, they hustle work when they can, living a hand-to-mouth existence. But George and Lennie have a plan: to own an acre of land and a shack they can call their own.,While the powerlessness of the laboring class is a recurring theme in Steinbeck's work of the late 1930s, he narrowed his focus when composing ,, creating an intimate portrait of two men facing a world marked by petty tyranny, misunderstanding, jealousy, and callousness. But though the scope is narrow, the theme is universal: a friendship and a shared dream that makes an individual's existence meaningful.,A unique perspective on life's hardships, this story has achieved the status of timeless classic due to its remarkable success as a novel, a Broadway play, and three acclaimed films.","genres":"Classics,Fiction,School,Historical Fiction,Literature,Read For School,Novels","price":"51,162"},{"index":82,"name":"Charlotte’s Web","author":"E.B. White","rating":4.2,"description":"This beloved book by E. B. White, author of , and ,, is a classic of children's literature that is \"just about perfect.\" This high-quality paperback features vibrant illustrations colorized by Rosemary Wells!,Some Pig. Humble. Radiant. These are the words in Charlotte's Web, high up in Zuckerman's barn. Charlotte's spiderweb tells of her feelings for a little pig named Wilbur, who simply wants a friend. They also express the love of a girl named Fern, who saved Wilbur's life when he was born the runt of his litter.,E. B. White's Newbery Honor Book is a tender novel of friendship, love, life, and death that will continue to be enjoyed by generations to come. This edition contains newly color illustrations by Garth Williams, the acclaimed illustrator of E. B. White's , and Laura Ingalls Wilder's Little House series, among many other books.","genres":"Classics,Fiction,Childrens,Fantasy,Young Adult,Middle Grade,Animals","price":"23,334"},{"index":83,"name":"Ender’s Game","author":"Orson Scott Card","rating":4.31,"description":"Andrew \"Ender\" Wiggin thinks he is playing computer simulated war games; he is, in fact, engaged in something far more desperate. The result of genetic experimentation, Ender may be the military genius Earth desperately needs in a war against an alien enemy seeking to destroy all human life. The only way to find out is to throw Ender into ever harsher training, to chip away and find the diamond inside, or destroy him utterly. Ender Wiggin is six years old when it begins. He will grow up fast.,But Ender is not the only result of the experiment. The war with the Buggers has been raging for a hundred years, and the quest for the perfect general has been underway almost as long. Ender's two older siblings, Peter and Valentine, are every bit as unusual as he is, but in very different ways. While Peter was too uncontrollably violent, Valentine very nearly lacks the capability for violence altogether. Neither was found suitable for the military's purpose. But they are driven by their jealousy of Ender, and by their inbred drive for power. Peter seeks to control the political process, to become a ruler. Valentine's abilities turn more toward the subtle control of the beliefs of commoner and elite alike, through powerfully convincing essays. Hiding their youth and identities behind the anonymity of the computer networks, these two begin working together to shape the destiny of Earth-an Earth that has no future at all if their brother Ender fails.","genres":"Science Fiction,Fiction,Young Adult,Fantasy,Classics,Science Fiction Fantasy,Dystopia","price":"49,119"},{"index":84,"name":"The Help","author":"Kathryn Stockett","rating":4.47,"description":"Three ordinary women are about to take one extraordinary step.,Twenty-two-year-old Skeeter has just returned home after graduating from Ole Miss. She may have a degree, but it is 1962, Mississippi, and her mother will not be happy till Skeeter has a ring on her finger. Skeeter would normally find solace with her beloved maid Constantine, the woman who raised her, but Constantine has disappeared and no one will tell Skeeter where she has gone.,Aibileen is a black maid, a wise, regal woman raising her seventeenth white child. Something has shifted inside her after the loss of her own son, who died while his bosses looked the other way. She is devoted to the little girl she looks after, though she knows both their hearts may be broken.,Minny, Aibileen's best friend, is short, fat, and perhaps the sassiest woman in Mississippi. She can cook like nobody's business, but she can't mind her tongue, so she's lost yet another job. Minny finally finds a position working for someone too new to town to know her reputation. But her new boss has secrets of her own.,Seemingly as different from one another as can be, these women will nonetheless come together for a clandestine project that will put them all at risk. And why? Because they are suffocating within the lines that define their town and their times. And sometimes lines are made to be crossed.,In pitch-perfect voices, Kathryn Stockett creates three extraordinary women whose determination to start a movement of their own forever changes a town, and the way women, mothers, daughters, caregivers, friends, view one another. A deeply moving novel filled with poignancy, humor, and hope, The Help is a timeless and universal story about the lines we abide by, and the ones we don't. ","genres":"Fiction,Historical Fiction,Historical,Adult,Adult Fiction,Contemporary,Audiobook","price":"89,868"},{"index":85,"name":"Dracula","author":"Bram Stoker","rating":4.01,"description":"When Jonathan Harker visits Transylvania to help Count Dracula with the purchase of a London house, he makes a series of horrific discoveries about his client. Soon afterwards, various bizarre incidents unfold in England: an apparently unmanned ship is wrecked off the coast of Whitby; a young woman discovers strange puncture marks on her neck; and the inmate of a lunatic asylum raves about the 'Master' and his imminent arrival.,In ,, Bram Stoker created one of the great masterpieces of the horror genre, brilliantly evoking a nightmare world of vampires and vampire hunters and also illuminating the dark corners of Victorian sexuality and desire.,This Norton Critical Edition includes a rich selection of background and source materials in three areas: Contexts includes probable inspirations for Dracula in the earlier works of James Malcolm Rymer and Emily Gerard. Also included are a discussion of Stoker's working notes for the novel and \"Dracula's Guest,\" the original opening chapter to Dracula. Reviews and Reactions reprints five early reviews of the novel. \"Dramatic and Film Variations\" focuses on theater and film adaptations of Dracula, two indications of the novel's unwavering appeal. David J. Skal, Gregory A. Waller, and Nina Auerbach offer their varied perspectives. Checklists of both dramatic and film adaptations are included.,Criticism collects seven theoretical interpretations of Dracula by Phyllis A. Roth, Carol A. Senf, Franco Moretti, Christopher Craft, Bram Dijkstra, Stephen D. Arata, and Talia Schaffer.,A Chronology and a Selected Bibliography are included.","genres":"Classics,Horror,Fiction,Fantasy,Vampires,Gothic,Paranormal","price":"44,718"},{"index":86,"name":"The Hitchhiker's Guide to the Galaxy","author":"Douglas Adams","rating":4.23,"description":"Seconds before the Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker's Guide to the Galaxy who, for the last fifteen years, has been posing as an out-of-work actor.,Together this dynamic pair begin a journey through space aided by quotes from The Hitchhiker's Guide (\"A towel is about the most massively useful thing an interstellar hitchhiker can have\") and a galaxy-full of fellow travelers: Zaphod Beeblebrox--the two-headed, three-armed ex-hippie and totally out-to-lunch president of the galaxy; Trillian, Zaphod's girlfriend (formally Tricia McMillan), whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; Veet Voojagig, a former graduate student who is obsessed with the disappearance of all the ballpoint pens he bought over the years.,Where are these pens? Why are we born? Why do we die? Why do we spend so much time between wearing digital watches? For all the answers stick your thumb to the stars. And don't forget to bring a towel!","genres":"Science Fiction,Fiction,Humor,Fantasy,Comedy,Science Fiction Fantasy,Audiobook","price":"44,168"},{"index":87,"name":"Anne of Green Gables","author":"L.M. Montgomery","rating":4.31,"description":"This heartwarming story has beckoned generations of readers into the special world of Green Gables, an old-fashioned farm outside a town called Avonlea. Anne Shirley, an eleven-year-old orphan, has arrived in this verdant corner of Prince Edward Island only to discover that the Cuthberts—elderly Matthew and his stern sister, Marilla—want to adopt a boy, not a feisty redheaded girl. But before they can send her back, Anne—who simply must have more scope for her imagination and a real home—wins them over completely. A much-loved classic that explores all the vulnerability, expectations, and dreams of a child growing up, , is also a wonderful portrait of a time, a place, a family… and, most of all, love. ,WITH AN AFTERWORD BY JENNIFER LEE CARELL","genres":"Classics,Fiction,Young Adult,Historical Fiction,Childrens,Middle Grade,Audiobook","price":"37,712"},{"index":88,"name":"Romeo and Juliet","author":"William Shakespeare","rating":3.74,"description":"In ,, Shakespeare creates a violent world, in which two young people fall in love. It is not simply that their families disapprove; the Montagues and the Capulets are engaged in a blood feud.,In this death-filled setting, the movement from love at first sight to the lovers’ final union in death seems almost inevitable. And yet, this play set in an extraordinary world has become the quintessential story of young love. In part because of its exquisite language, it is easy to respond as if it were about all young lovers.","genres":"Classics,Plays,Fiction,School,Drama,Read For School,Literature","price":"30,523"},{"index":89,"name":"City of Bones","author":"Cassandra Clare","rating":4.07,"description":"When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is nothing―not even a smear of blood―to show that a boy has died. Or was he a boy?,This is Clary's first meeting with the Shadowhunters, warriors dedicated to ridding the earth of demons. It's also her first encounter with Jace, a Shadowhunter who looks a little like an angel and acts a lot like a jerk. Within twenty-four hours Clary is pulled into Jace's world with a vengeance when her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in ordinary mundanes like Clary and her mother? And how did Clary suddenly get the Sight? The Shadowhunters would like to know...","genres":"Fantasy,Young Adult,Romance,Paranormal,Urban Fantasy,Fiction,Vampires","price":"74,874"},{"index":90,"name":"Lord of the Flies","author":"William Golding","rating":3.69,"description":"At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate; this far from civilization the boys can do anything they want. Anything. They attempt to forge their own society, failing, however, in the face of terror, sin and evil. And as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far from reality as the hope of being rescued. Labeled a parable, an allegory, a myth, a morality tale, a parody, a political treatise, even a vision of the apocalypse, Lord of the Flies is perhaps our most memorable novel about “the end of innocence, the darkness of man’s heart.”","genres":"Fiction,Classics,Young Adult,School,Literature,Dystopia,Read For School","price":"54,450"},{"index":91,"name":"Les Misérables","author":"Victor Hugo","rating":4.2,"description":"Victor Hugo's tale of injustice, heroism and love follows the fortunes of Jean Valjean, an escaped convict determined to put his criminal past behind him. But his attempts to become a respected member of the community are constantly put under threat: by his own conscience, when, owing to a case of mistaken identity, another man is arrested in his place; and by the relentless investigations of the dogged Inspector Javert. It is not simply for himself that Valjean must stay free, however, for he has sworn to protect the baby daughter of Fantine, driven to prostitution by poverty.","genres":"Classics,Fiction,Historical Fiction,Literature,France,Historical,Novels","price":"22,467"},{"index":92,"name":"Divergent","author":"Veronica Roth","rating":4.15,"description":"","genres":"","price":"119,526"},{"index":93,"name":"The Giving Tree","author":"Shel Silverstein","rating":4.38,"description":"\"Once there was a tree...and she loved a little boy.\",So begins a story of unforgettable perception, beautifully written and illustrated by the gifted and versatile Shel Silverstein.,Every day the boy would come to the tree to eat her apples, swing from her branches, or slide down her trunk...and the tree was happy. But as the boy grew older he began to want more from the tree, and the tree gave and gave and gave.,This is a tender story, touched with sadness, aglow with consolation. Shel Silverstein has created a moving parable for readers of all ages that offers an affecting interpretation of the gift of giving and a serene acceptance of another's capacity to love in return.","genres":"Childrens,Classics,Fiction,Picture Books,Poetry,Young Adult,Fantasy","price":"21,876"},{"index":94,"name":"Alice’s Adventures in Wonderland \/ Through the Looking-Glass","author":"Lewis Carroll","rating":4.06,"description":"\"I can't explain myself, I'm afraid, sir,\" said Alice, \"Because I'm not myself, you see.\",When Alice sees a white rabbit take a watch out of its waistcoat pocket she decides to follow it, and a sequence of most unusual events is set in motion. This mini book contains the entire topsy-turvy stories of Alice's Adventures in Wonderland and Through the Looking-Glass, accompanied by practical notes and Martina Pelouso's memorable full-colour illustrations.","genres":"Fantasy,Fiction,Classics,Childrens,Young Adult,Literature,Adventure","price":"15,145"},{"index":95,"name":"The Da Vinci Code","author":"Dan Brown","rating":3.91,"description":".,While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body covered in baffling symbols. As Langdon and gifted French cryptologist Sophie Neveu sort through the bizarre riddles, they are stunned to discover a trail of clues hidden in the works of Leonardo da Vinci—clues visible for all to see and yet ingeniously disguised by the painter.,Even more startling, the late curator was involved in the Priory of Sion—a secret society whose members included Sir Isaac Newton, Victor Hugo, and Da Vinci—and he guarded a breathtaking historical secret. Unless Langdon and Neveu can decipher the labyrinthine puzzle—while avoiding the faceless adversary who shadows their every move—the explosive, ancient truth will be lost forever.","genres":"Fiction,Mystery,Thriller,Mystery Thriller,Historical Fiction,Suspense,Adventure","price":"54,247"},{"index":96,"name":"Crime and Punishment","author":"Fyodor Dostoevsky","rating":4.26,"description":"Raskolnikov, a destitute and desperate former student, wanders through the slums of St Petersburg and commits a random murder without remorse or regret. He imagines himself to be a great man, a Napoleon: acting for a higher purpose beyond conventional moral law. But as he embarks on a dangerous game of cat and mouse with a suspicious police investigator, Raskolnikov is pursued by the growing voice of his conscience and finds the noose of his own guilt tightening around his neck. Only Sonya, a downtrodden sex worker, can offer the chance of redemption.","genres":"Classics,Fiction,Russia,Literature,Russian Literature,Philosophy,Novels","price":"34,682"},{"index":97,"name":"Harry Potter and the Sorcerer’s Stone","author":"J.K. Rowling","rating":4.47,"description":"\"Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'.\",Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!","genres":"Fantasy,Fiction,Young Adult,Magic,Childrens,Middle Grade,Audiobook","price":"158,305"},{"index":98,"name":"The Perks of Being a Wallflower","author":"Stephen Chbosky","rating":4.23,"description":"standing on the fringes of life...,offers a unique perspective. But there comes a time to see,what it looks like from the dance floor.,This haunting novel about the dilemma of passivity vs. passion marks the stunning debut of a provocative new voice in contemporary fiction: The Perks of Being A WALLFLOWER,This is the story of what it's like to grow up in high school. More intimate than a diary, Charlie's letters are singular and unique, hilarious and devastating. We may not know where he lives. We may not know to whom he is writing. All we know is the world he shares. Caught between trying to live his life and trying to run from it puts him on a strange course through uncharted territory. The world of first dates and mixed tapes, family dramas and new friends. The world of sex, drugs, and The Rocky Horror Picture Show, when all one requires is that the perfect song on that perfect drive to feel infinite.,Through Charlie, Stephen Chbosky has created a deeply affecting coming-of-age story, a powerful novel that will spirit you back to those wild and poignant roller coaster days known as growing up.,(back cover)","genres":"Young Adult,Fiction,Coming Of Age,Classics,Romance,Mental Health,Realistic Fiction","price":"88,671"},{"index":99,"name":"Memoirs of a Geisha","author":"Arthur Golden","rating":4.15,"description":"A literary sensation and runaway bestseller, this brilliant novel presents with seamless authenticity and exquisite lyricism the true confessions of one of Japan's most celebrated geisha.,In \"Memoirs of a Geisha,\" we enter a world where appearances are paramount; where a girl's virginity is auctioned to the highest bidder; where women are trained to beguile the most powerful men; and where love is scorned as illusion. It is a unique and triumphant work of fiction - at once romantic, erotic, suspenseful - and completely unforgettable.","genres":"Fiction,Historical Fiction,Romance,Classics,Historical,Japan,Adult","price":"35,502"},{"index":100,"name":"Wuthering Heights","author":"Emily Brontë","rating":3.89,"description":"At the centre of this novel is the passionate love between Catherine Earnshaw and Heathcliff - recounted with such emotional intensity that a plain tale of the Yorkshire moors acquires the depth and simplicity of ancient tragedy.,This best-selling Norton Critical Edition is based on the 1847 first edition of the novel. For the Fourth Edition, the editor has collated the 1847 text with several modern editions and has corrected a number of variants, including accidentals. The text is accompanied by entirely new explanatory annotations.,New to the fourth Edition are twelve of Emily Bronte's letters regarding the publication of the 1847 edition of Wuthering Heights as well as the evolution of the 1850 edition, prose and poetry selections by the author, four reviews of the novel, and poetry selections by the author, four reviews of the novel, and Edward Chitham's insightful and informative chronology of the creative process behind the beloved work.,Five major critical interpretations of Wuthering Heights are included, three of them new to the Fourth Edition. A Stuart Daley considers the importance of chronology in the novel. J. Hillis Miller examines Wuthering Heights's problems of genre and critical reputation. Sandra M. Gilbert assesses the role of Victorian Christianity plays in the novel, while Martha Nussbaum traces the novel's romanticism. Finally, Lin Haire-Sargeant scrutinizes the role of Heathcliff in film adaptations of Wuthering Heights. ,A Chronology and updated Selected Bibliography are also included.","genres":"Classics,Fiction,Romance,Gothic,Historical Fiction,Literature,19th Century","price":"59,760"}]